In [1]:
# PERTEMUAN 12 : Master data cleaning and preparation techniques using Pandas
# EXERCISE 1
import pandas as pd

# Contoh dataset dengan beberapa nilai yang hilang
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', None],
    'Age': [24, 30, None, 22, 35],
    'Salary': [48000, None, 57000, None, 60000]
}
df = pd.DataFrame(data)

# Mengisi data hilang dan menghapus baris yang tidak perlu
df['Age'].fillna(df['Age'].mean(), inplace=True)         # Ganti Age kosong dengan rata-rata
df['Salary'].fillna(df['Salary'].median(), inplace=True) # Ganti Salary kosong dengan median
df.dropna(subset=['Name'], inplace=True)                 # Hapus baris yang name nya kosong

print('After cleaning:\n', df)

# EXERCISE 2
# Contoh dataset dengan kategori yang tidak konsisten
data = {
    'Product': ['Laptop', 'Laptop', 'Desktop', 'Tablet', 'Tablet'],
    'Category': ['Electronics', 'electronics', 'Electronics', 'Gadgets', 'gadgets']
}
df = pd.DataFrame(data)

# Standarisasi kategori (huruf pertama kapital)
df['Category'] = df['Category'].str.capitalize()

print('\nStandardized Data:\n', df)

After cleaning:
       Name    Age   Salary
0    Alice  24.00  48000.0
1      Bob  30.00  57000.0
2  Charlie  27.75  57000.0
3    David  22.00  57000.0

Standardized Data:
    Product     Category
0   Laptop  Electronics
1   Laptop  Electronics
2  Desktop  Electronics
3   Tablet      Gadgets
4   Tablet      Gadgets

/tmp/ipykernel_3189/1198509413.py:14: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(df['Age'].mean(), inplace=True)         # Ganti Age kosong dengan rata-rata
/tmp/ipykernel_3189/1198509413.py:15: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Salary'].fillna(df['Salary'].median(), inplace=True) # Ganti Salary kosong dengan median

In [2]:
# PRACTICE TASKS
# 1 : Load Dataset dan Identfikasi Missing Values
# LOAD DATASET
import pandas as pd

df = pd.read_csv("/home/zara/Downloads/archive/Titanic-Dataset.csv")

print("Load dataset berhasil!")
print("Jumlah baris dan kolom :", df.shape)
print("--------------------------------")
df.head()

# IDENTIFIKASI MISSING VALUES
print(">> Missing values <<")
df.isnull().sum()

Load dataset berhasil!
Jumlah baris dan kolom : (891, 12)
--------------------------------
>> Missing values <<

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [3]:
# HANDLING MISSING VALUES
# Age 
df['Age'].fillna(df['Age'].median(), inplace=True)

# Embarked 
df['Embarked'].fillna(df['Embarked'].mode()[0], inplace=True)

# Cabin 
df.drop(columns=['Cabin'], inplace=True)

print(">> Missing values after cleaning <<")
print(df.isnull().sum())

>> Missing values after cleaning <<
PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

/tmp/ipykernel_3189/1676515334.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(df['Age'].median(), inplace=True)
/tmp/ipykernel_3189/1676515334.py:6: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Embarked'].fillna(df['Embarked'].mode()[0], inplace=True)

In [4]:
# 2 : Data Transformation untuk Normalisasi Kolom Numerik
df['Age_norm'] = (df['Age'] - df['Age'].min()) / (df['Age'].max() - df['Age'].min())
df['Fare_norm'] = (df['Fare'] - df['Fare'].min()) / (df['Fare'].max() - df['Fare'].min())

print(df[['Age', 'Age_norm', 'Fare', 'Fare_norm']].head())

    Age  Age_norm     Fare  Fare_norm
0  22.0  0.271174   7.2500   0.014151
1  38.0  0.472229  71.2833   0.139136
2  26.0  0.321438   7.9250   0.015469
3  35.0  0.434531  53.1000   0.103644
4  35.0  0.434531   8.0500   0.015713

In [5]:
# 3 : Standarisasi Kolom Kategorikal dan Hapus Duplikasi
# STANDARISASI KOLOM KATEGORIKAL
df['Sex'] = df['Sex'].str.capitalize()
df['Embarked'] = df['Embarked'].str.upper()

print(">> After Standardizing Categorical Columns <<")
print(df[['Sex', 'Embarked']].head())

>> After Standardizing Categorical Columns <<
      Sex Embarked
0    Male        S
1  Female        C
2  Female        S
3  Female        S
4    Male        S

In [6]:
# HAPUS DUPLIKASI
df_clean = df.drop_duplicates()

print(">> After Hapus Duplikasi <<")
print(df_clean.shape)

# HASIL AKHIR
print("\n>> Final Cleaned Data (first 10 rows) <<")
df_clean.head(10)

>> After Hapus Duplikasi <<
(891, 13)

>> Final Cleaned Data (first 10 rows) <<

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Age_norm,Fare_norm
0,1,0,3,"Braund, Mr. Owen Harris",Male,22.0,1,0,A/5 21171,7.2500,S,0.271174,0.014151
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",Female,38.0,1,0,PC 17599,71.2833,C,0.472229,0.139136
2,3,1,3,"Heikkinen, Miss. Laina",Female,26.0,0,0,STON/O2. 3101282,7.9250,S,0.321438,0.015469
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",Female,35.0,1,0,113803,53.1000,S,0.434531,0.103644
4,5,0,3,"Allen, Mr. William Henry",Male,35.0,0,0,373450,8.0500,S,0.434531,0.015713
5,6,0,3,"Moran, Mr. James",Male,28.0,0,0,330877,8.4583,Q,0.346569,0.016510
6,7,0,1,"McCarthy, Mr. Timothy J",Male,54.0,0,0,17463,51.8625,S,0.673285,0.101229
7,8,0,3,"Palsson, Master. Gosta Leonard",Male,2.0,3,1,349909,21.0750,S,0.019854,0.041136
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",Female,27.0,0,2,347742,11.1333,S,0.334004,0.021731
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",Female,14.0,1,0,237736,30.0708,C,0.170646,0.058694

In [7]:
# HOMEWORK
# Membersihkan dataset, normalisasi, menangani outlier, dan menyiapkan data untuk analisis
# LOAD DATASET
df = pd.read_csv("/home/zara/Downloads/archive/disney_movies.csv")

print("Load dataset berhasil!")
print("Jumlah baris dan kolom :", df.shape)
print("--------------------------------")
df.head()

Load dataset berhasil!
Jumlah baris dan kolom : (579, 6)
--------------------------------

,movie_title,release_date,genre,mpaa_rating,total_gross,inflation_adjusted_gross
0,Snow White and the Seven Dwarfs,1937-12-21,Musical,G,184925485,5228953251
1,Pinocchio,1940-02-09,Adventure,G,84300000,2188229052
2,Fantasia,1940-11-13,Musical,G,83320000,2187090808
3,Song of the South,1946-11-12,Adventure,G,65000000,1078510579
4,Cinderella,1950-02-15,Drama,G,85000000,920608730

In [8]:
# CEK MISSING VALUES
print(">> Missing values <<")
df.isnull().sum()

>> Missing values <<

movie_title                  0
release_date                 0
genre                       17
mpaa_rating                 56
total_gross                  0
inflation_adjusted_gross     0
dtype: int64

In [9]:
# HANDLING MISSING VALUES
# genre (kategori) -> isi mode
df['genre'] = df['genre'].fillna(df['genre'].mode()[0])

# mpaa_rating (kategori) -> isi mode
df['mpaa_rating'] = df['mpaa_rating'].fillna(df['mpaa_rating'].mode()[0])

# pastikan movie_title tidak kosong
df = df.dropna(subset=['movie_title'])

# cek ulang
print(">> After Handling Missing Values <<\n")
print(df.isnull().sum())

>> After Handling Missing Values <<

movie_title                 0
release_date                0
genre                       0
mpaa_rating                 0
total_gross                 0
inflation_adjusted_gross    0
dtype: int64

In [14]:
# REMOVE DUPLICATES
print("Jumlah baris sebelum hapus duplikat :", len(df))
df.drop_duplicates(inplace=True)
print("Jumlah baris setelah hapus duplikat :", len(df))

Jumlah baris sebelum hapus duplikat : 579
Jumlah baris setelah hapus duplikat : 579

In [11]:
# STANDARISASI
df['genre'] = df['genre'].str.title()
df['mpaa_rating'] = df['mpaa_rating'].str.upper()

print(">> SETELAH STANDARISASI KATEGORI <<")
df[['movie_title', 'genre', 'mpaa_rating']].head()

>> SETELAH STANDARISASI KATEGORI <<

                       movie_title      genre mpaa_rating
0  Snow White and the Seven Dwarfs    Musical           G
1                        Pinocchio  Adventure           G
2                         Fantasia    Musical           G
3                Song of the South  Adventure           G
4                       Cinderella      Drama           G

In [12]:
# HANDLE OUTLIERS (IQR)
num_cols = ['total_gross', 'inflation_adjusted_gross']
print("Before Outlier Handling:")
print(df[num_cols].describe(), "\n")

for col in num_cols:
    Q1 = df[col].quantile(0.25)
    Q3 = df[col].quantile(0.75)
    IQR = Q3 - Q1

    lower = Q1 - 1.5 * IQR
    upper = Q3 + 1.5 * IQR
    
print(">> Cek setelah outliers handling <<")
print(col, "outliers below:", (df[col] < lower).sum())
print(col, "outliers above:", (df[col] > upper).sum())

Before Outlier Handling:
        total_gross  inflation_adjusted_gross
count  5.790000e+02              5.790000e+02
mean   6.470179e+07              1.187625e+08
std    9.301301e+07              2.860853e+08
min    0.000000e+00              0.000000e+00
25%    1.278886e+07              2.274123e+07
50%    3.070245e+07              5.515978e+07
75%    7.570903e+07              1.192020e+08
max    9.366622e+08              5.228953e+09

>> Cek setelah outliers handling <<
inflation_adjusted_gross outliers below: 0
inflation_adjusted_gross outliers above: 55

In [19]:
# NORMALIZATION
df['total_gross_norm'] = (df['total_gross'] - df['total_gross'].min()) / (df['total_gross'].max() - df['total_gross'].min())
df['infl_adj_norm']   = (df['inflation_adjusted_gross'] - df['inflation_adjusted_gross'].min()) / (df['inflation_adjusted_gross'].max() - df['inflation_adjusted_gross'].min())

# Tampilkan hasil normalisasi
df[['total_gross', 'total_gross_norm', 'inflation_adjusted_gross', 'infl_adj_norm']].head()

   total_gross  total_gross_norm  inflation_adjusted_gross  infl_adj_norm
0    184925485          0.197430                5228953251       1.000000
1     84300000          0.090000                2188229052       0.418483
2     83320000          0.088954                2187090808       0.418266
3     65000000          0.069395                1078510579       0.206257
4     85000000          0.090748                 920608730       0.176060

In [24]:
# FINAL DATASET (siap analisis)
print("=== FINAL DATASET ===")
df.head((12))

=== FINAL DATASET ===

,movie_title,release_date,genre,mpaa_rating,total_gross,inflation_adjusted_gross,total_gross_norm,inflation_adjusted_gross_norm,infl_adj_norm
0,Snow White and the Seven Dwarfs,1937-12-21,Musical,G,184925485,5228953251,0.197430,1.000000,1.000000
1,Pinocchio,1940-02-09,Adventure,G,84300000,2188229052,0.090000,0.418483,0.418483
2,Fantasia,1940-11-13,Musical,G,83320000,2187090808,0.088954,0.418266,0.418266
3,Song of the South,1946-11-12,Adventure,G,65000000,1078510579,0.069395,0.206257,0.206257
4,Cinderella,1950-02-15,Drama,G,85000000,920608730,0.090748,0.176060,0.176060
5,"20,000 Leagues Under the Sea",1954-12-23,Adventure,PG,28200000,528279994,0.030107,0.101030,0.101030
6,Lady and the Tramp,1955-06-22,Drama,G,93600000,1236035515,0.099929,0.236383,0.236383
7,Sleeping Beauty,1959-01-29,Drama,PG,9464608,21505832,0.010105,0.004113,0.004113
8,101 Dalmatians,1961-01-25,Comedy,G,153000000,1362870985,0.163346,0.260639,0.260639
9,The Absent Minded Professor,1961-03-16,Comedy,PG,25381407,310094574,0.027098,0.059303,0.059303
10,Babes in Toyland,1961-12-14,Musical,G,10218316,124841160,0.010909,0.023875,0.023875
11,Bon Voyage!,1962-05-17,Comedy,NOT RATED,9230769,109581646,0.009855,0.020957,0.020957